
#######################################
# 히스토그램 연습문제
#######################################

# 다음 데이터를 이용해 히스토그램을 그리시오.

score <- c(65,90,98,88,78,60,59,72,82,84,86,92,77,72)
age <- c(28,35,40,32,36,39,41,38,33,30,27,34,35,43)

hist(score)
hist(age)

#######################################
# pie() 연습문제
#######################################

# 다음 데이터를 이용해 pie 그래프를 그리시오.

p1 <- c(24,18,17,9,8)
pct <- round(p1/sum(p1)*100,1)
lab <- paste(pct,"%")

pie(p1,radius=1,init.angle=90,
    main="20대 최근 관심",
    labels=lab,
    col=rainbow(length(p1)))

legend('top',
       c("취직","친구이성","학업성적","결혼","외모"),
       cex=1,
       fill=rainbow(length(p1)))

## 범례 위치 확인 (-1 ~ +1)
legend(-1,1,
       c("취직","친구이성","학업성적","결혼","외모"),
       cex=0.5,
       fill=rainbow(length(p1)))

legend(-0.5,1,
       c("취직","친구이성","학업성적","결혼","외모"),
       cex=1,
       fill=rainbow(length(p1)))

legend(0.1,
       c("취직","친구이성","학업성적","결혼","외모"),
       cex=0.5,
       fill=rainbow(length(p1)))

legend(0.5,1,
       c("취직","친구이성","학업성적","결혼","외모"),
       cex=0.5,
       fill=rainbow(length(p1)))

legend(1,1,
       c("취직","친구이성","학업성적","결혼","외모"),
       cex=0.5,
       fill=rainbow(length(p1)))


#######################################
# boxplot() 연습문제
#######################################

# 다음 데이터를 이용해 상자 차트를 그리시오.

v1 <- c(37.4,50.3,63.6,67.2,81.1)
v2 <- c(82.2,88.1,84.7,77.2,56.3)

boxplot(v1,v2,
        main="미디어 이용율",
        col=c('blue','yellow'),
        names=c('TV 이용율','스마트폰 이용율'),
        horizontal=T)